  # Пользователь вводит целое положительное число.
  # Найдите самую большую цифру в числе. Для решения используйте цикл while и арифметические операции.

n = input('Please input the number: ')
if '9' in n:
    print('Biggest number is 9')
elif '8' in n:
    print('Biggest number is 8')
elif '7' in n:
    print('Biggest number is 7')
elif '6' in n:
    print('Biggest number is 6')
elif '5' in n:
    print('Biggest number is 5')
elif '4' in n:
    print('Biggest number is 4')
elif '3' in n:
    print('Biggest number is 3')
elif '2' in n:
    print('Biggest number is 2')
elif '1' in n:
    print('Biggest number is 1')
